[
  {
    "id": 1,
    "title": "Paper Published: Finding Optimal Teams – An Analysis of NBA Statistics and Constraints",
    "date": "July 21, 2025",
    "content": "A new research paper presents an innovative approach to NBA team selection using machine learning and optimization.",
    "imageUrl": null,
    "story": "<p><strong>Authors:</strong> Shaykh Siddique, Lin Li, Yonghui Wang<br><strong>Conference:</strong> 2025 IEEE 11th International Conference on Big Data Computing Service and Machine Learning Applications (BigDataService)<br><strong>Pages:</strong> 26-34<br><strong>Publisher:</strong> IEEE</p><p>In the dynamic realm of NBA team management, balancing the intricacies of player performance and strategic signings presents formidable challenges. Negotiating salary caps, player roles, on-court minutes, and contract durations requires a nuanced approach. This study comprehensively evaluates player efficiency and team performance, scrutinizing key statistical indicators like Points, Rebounds, Assists, Blocks, PER, RPM, Shot Charts, and others. Leveraging machine learning algorithms, including logistic, ridge, and lasso regressions, facilitates modeling the intricate relationship between player performance and team winning rates. Based on that, team player selection is formulated as a linear programming optimization problem incorporating practical constraints. Analyzing NBA player and game stats from 2012 to 2022, the experimental findings underscore the accuracy of prediction models and the value of data-driven strategies for team building.</p>"
  },
  {
    "id": 2,
    "title": "Paper Published: An Enhanced Strategy of Detecting Neurological Disorders from MRI Using Deep Learning",
    "date": "September 25, 2023",
    "content": "Recent publication showcases a custom deep learning architecture for detecting neurological disorders from MRI images.",
    "imageUrl": null,
    "story": "<p><strong>Authors:</strong> Shaykh Siddique, Shahana Shultana, Sherri Frizell<br><strong>Conference:</strong> 2023 IEEE Sixth International Conference on Artificial Intelligence and Knowledge Engineering (AIKE)<br><strong>Pages:</strong> 99-104<br><strong>Publisher:</strong> IEEE</p><p>Deep learning technologies are increasingly used to analyze brain functionalities and extract beneficial features from neuroimaging data. This paper describes a multi-layered deep convolutional neural network system for detecting neurological disorders from MRI images, enhanced by grey wolf optimization for hyperparameter tuning. Multiple models were compared for medical image classification, and the proposed system outperformed existing architectures on the tested dataset. The model successfully detects the six most common neurological disorders, including Cerebral Aneurysm, Alzheimer's disease, and Parkinson's disease, demonstrating strong potential for AI-assisted medical diagnostics.</p>"
  },
  {
    "id": 3,
    "title": "Outstanding Student Award 2023 Recognized by Prairie View A&M University",
    "date": "May 23, 2023",
    "content": "Recognition received for academic achievement: Outstanding Student Award 2023 from Prairie View A&M University.",
    "imageUrl": null,
    "story": "<p>The Outstanding Student Award 2023 was presented by Prairie View A&M University in recognition of exceptional academic performance and dedication. This honor highlights not only scholarly achievements, but also contributions to research, leadership, and service throughout the degree program.</p>"
  }
]
